In [1]:
import pandas as pd
import numpy as np
import os
from matplotlib import pyplot as plt
import seaborn as sns

In [80]:
pip install xlrd==1.2.0

Collecting xlrd==1.2.0
  Downloading xlrd-1.2.0-py2.py3-none-any.whl (103 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 103.3/103.3 kB 1.8 MB/s eta 0:00:0000:01
Installing collected packages: xlrd
  Attempting uninstall: xlrd
    Found existing installation: xlrd 2.0.1
    Uninstalling xlrd-2.0.1:
      Successfully uninstalled xlrd-2.0.1
Successfully installed xlrd-1.2.0

[notice] A new release of pip available: 22.2.2 -> 22.3
[notice] To update, run: /Users/zouserena/Library/CloudStorage/OneDrive-TheBostonConsultingGroup,Inc/00 L&D/03 Self-learning/03 cousera/python_for_ml/.env/bin/python -m pip install --upgrade pip
Note: you may need to restart the kernel to use updated packages.

### 1. Get path info

In [69]:
os.getcwd()

'/Users/zouserena/Library/CloudStorage/OneDrive-TheBostonConsultingGroup,Inc/00 L&D/03 Self-learning/03 cousera/python_for_ml'

### 2. Create df/series from dictionary/np.array

In [2]:
# pd.series can take in a dict and turn keys into index 
my_dict = {'name': 'serena', 'hobby': 'piano'}
print(pd.Series(my_dict))

name     serena
hobby     piano
dtype: object

In [6]:
# add with fill na
q1 = pd.Series({'Japan': 80, 'China': 450, 'India': 200, 'USA': 250})
q2 = pd.Series({'Brazil': 100,'China': 500, 'India': 210,'USA': 260})
q1.add(q2,fill_value=0)

Brazil    100.0
China     950.0
India     410.0
Japan      80.0
USA       510.0
dtype: float64

In [10]:
# create a df from np.array 
data = np.random.randint(1, 10, (3,3))
col_names = ['one', 'two', 'three']
index_names = ['a', 'b', 'c']
df = pd.DataFrame(data, index=index_names, columns=col_names)
print(df)

   one  two  three
a    6    6      3
b    5    4      1
c    6    7      4

In [ ]:
# create a df from dict
pd.DataFrame(dic.items())

### 3. Basics

In [11]:
# df basics 
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, a to c
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   one     3 non-null      int64
 1   two     3 non-null      int64
 2   three   3 non-null      int64
dtypes: int64(3)
memory usage: 96.0+ bytes

In [12]:
df.describe().transpose()

       count      mean       std  min  25%  50%  75%  max
one      3.0  5.666667  0.577350  5.0  5.5  6.0  6.0  6.0
two      3.0  5.666667  1.527525  4.0  5.0  6.0  6.5  7.0
three    3.0  2.666667  1.527525  1.0  2.0  3.0  3.5  4.0

In [13]:
df.one.dtype

dtype('int64')

In [14]:
df.shape

(3, 3)

In [15]:
# columns drop
df.drop('one', axis=1)

   two  three
a    6      3
b    4      1
c    7      4

In [16]:
# index drop 
df.drop('a')

   one  two  three
b    5    4      1
c    6    7      4

In [36]:
# between 
df[df['total_bill'].between(10,20,inclusive=True)].head()

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,last_four,Tip Quality
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959,3410,Ok
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608,9230,Ok
8,15.04,1.96,Male,No,Sun,Dinner,2,7.52,Joseph Mcdonald,3522866365840377,Sun6820,0377,Ok
9,14.78,3.23,Male,No,Sun,Dinner,2,7.39,Jerome Abbott,3532124519049786,Sun3775,9786,Ok
10,10.27,1.71,Male,No,Sun,Dinner,2,5.14,William Riley,566287581219,Sun2546,1219,Ok

### 4.Missing values

In [39]:
# find missing value counts
df.isna().sum()

total_bill          0
tip                 0
sex                 0
smoker              0
day                 0
time                0
size                0
price_per_person    0
Payer Name          0
CC Number           0
Payment ID          0
last_four           0
dicount_bill        0
meal_time           0
dtype: int64

In [36]:
# columns has any missing value 
df.columns[df.isna().any()].tolist()

[]

### 5. Apply, Map, Lambda function method

In [16]:
# apply method (only takes in a single value and return a single value per row)
"""
1. lambda function is just an anoynimous function 
"""

df = pd.read_csv('UNZIP_FOR_NOTEBOOKS_FINAL//03-Pandas//tips.csv')

## 1. single column 
def last_four(num):
    return str(num)[-4:]
df['last_four'] = df['CC Number'].apply(last_four)


# 2. use lambda & map function
print(df['total_bill'].apply(lambda bill:bill*0.18))
df['dicount_bill'] = df['total_bill'].map(lambda bill:bill*0.8)
print(df[['total_bill', 'dicount_bill']].head())
map_dict = {'Dinner':'night', 'Lunch':'noon'}
df['meal_time'] = df['time'].map(map_dict)
print(df[['time', 'meal_time']])


# 3. multiple columns 
import timeit 
  
# code snippet to be executed only once 
setup = '''
import numpy as np
import pandas as pd

df = pd.read_csv('UNZIP_FOR_NOTEBOOKS_FINAL//03-Pandas//tips.csv')

def quality(total_bill,tip):
    if tip/total_bill  > 0.25:
        return "Generous"
    else:
        return "Other"
'''
  
# code snippet whose execution time is to be measured 
stmt_one = ''' 
df['Tip Quality'] = df[['total_bill','tip']].apply(lambda df: quality(df['total_bill'],df['tip']),axis=1)
'''

stmt_two = '''
df['Tip Quality'] = np.vectorize(quality)(df['total_bill'], df['tip'])
'''

print(timeit.timeit(setup = setup, 
                    stmt = stmt_one, 
                    number = 1000))
print(timeit.timeit(setup = setup, 
                    stmt = stmt_two, 
                    number = 1000) )

0      3.0582
1      1.8612
2      3.7818
3      4.2624
4      4.4262
        ...
239    5.2254
240    4.8924
241    4.0806
242    3.2076
243    3.3804
Name: total_bill, Length: 244, dtype: float64
   total_bill  dicount_bill
0       16.99        13.592
1       10.34         8.272
2       21.01        16.808
3       23.68        18.944
4       24.59        19.672
       time meal_time
0    Dinner     night
1    Dinner     night
2    Dinner     night
3    Dinner     night
4    Dinner     night
..      ...       ...
239  Dinner     night
240  Dinner     night
241  Dinner     night
242  Dinner     night
243  Dinner     night

[244 rows x 2 columns]
3.5007492339998407
0.4368205979999402

In [17]:
# apply using row 
df['Discounted_Price'] = df.apply(lambda row: row.Cost*0.1, axis=1)
df.head()

AttributeError: 'Series' object has no attribute 'Cost'

### 6. Return index of the max/min value

In [29]:
# idxmax & idxmin -> returns a Series with the index of the maximum value for each column
df['total_bill'].idxmax()

170

### 7. Value counts

In [30]:
# value counts 
df['sex'].value_counts()

Male      157
Female     87
Name: sex, dtype: int64

### 8. Replace values

In [35]:
# replace values 
"""
1. a few columns
"""
def quality(total_bill,tip):
    if tip/total_bill  > 0.25:
        return "Generous"
    else:
        return "Other"
df['Tip Quality'] = np.vectorize(quality)(df['total_bill'], df['tip'])
df['Tip Quality'] = df['Tip Quality'].replace(to_replace='Other',value='Ok')
print(df.head())


"""
2. multiple columns
"""
my_map = {'Dinner':'D','Lunch':'L'}
df['time'].map(my_map)

   total_bill   tip     sex smoker  day    time  size  price_per_person  \
0       16.99  1.01  Female     No  Sun  Dinner     2              8.49
1       10.34  1.66    Male     No  Sun  Dinner     3              3.45
2       21.01  3.50    Male     No  Sun  Dinner     3              7.00
3       23.68  3.31    Male     No  Sun  Dinner     2             11.84
4       24.59  3.61  Female     No  Sun  Dinner     4              6.15

           Payer Name         CC Number Payment ID last_four Tip Quality
0  Christy Cunningham  3560325168603410    Sun2959      3410          Ok
1      Douglas Tucker  4478071379779230    Sun4608      9230          Ok
2      Travis Walters  6011812112971322    Sun4458      1322          Ok
3    Nathaniel Harris  4676137647685994    Sun5260      5994          Ok
4        Tonya Carter  4832732618637221    Sun2251      7221          Ok

0      D
1      D
2      D
3      D
4      D
      ..
239    D
240    D
241    D
242    D
243    D
Name: time, Length: 244, dtype: object

### 9. Sample data

In [38]:
# sample 
print(df.sample(5))
print(df.sample(frac=0.01))

     total_bill   tip   sex smoker   day    time  size  price_per_person  \
112       38.07  4.00  Male     No   Sun  Dinner     3             12.69
89        21.16  3.00  Male     No  Thur   Lunch     2             10.58
95        40.17  4.73  Male    Yes   Fri  Dinner     4             10.04
152       17.26  2.74  Male     No   Sun  Dinner     3              5.75
40        16.04  2.24  Male     No   Sat  Dinner     3              5.35

        Payer Name         CC Number Payment ID last_four Tip Quality
112     Jeff Lopez  3572865915176463     Sun591      6463          Ok
89     Keith Lewis  4356005144080422   Thur6273      0422          Ok
95   Aaron Bentley   180026611638690    Fri9628      8690          Ok
152  Gregory Smith     4292362333741    Sun5205      3741          Ok
40    Adam Edwards  3544447755679420    Sat8549      9420          Ok
     total_bill  tip     sex smoker  day    time  size  price_per_person  \
100       11.35  2.5  Female    Yes  Fri  Dinner     2              5.68
178        9.60  4.0  Female    Yes  Sun  Dinner     2              4.80

       Payer Name       CC Number Payment ID last_four Tip Quality
100    Lori Lynch  38558279384492    Fri4106      4492          Ok
178  Melanie Gray   4211808859168    Sun4598      9168    Generous

In [39]:
# nlargest
df.nlargest(5, 'tip')

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,last_four,Tip Quality
170,50.81,10.00,Male,Yes,Sat,Dinner,3,16.94,Gregory Clark,5473850968388236,Sat1954,8236,Ok
212,48.33,9.00,Male,No,Sat,Dinner,4,12.08,Alex Williamson,676218815212,Sat4590,5212,Ok
23,39.42,7.58,Male,No,Sat,Dinner,4,9.86,Lance Peterson,3542584061609808,Sat239,9808,Ok
59,48.27,6.73,Male,No,Sat,Dinner,4,12.07,Brian Ortiz,6596453823950595,Sat8139,0595,Ok
141,34.30,6.70,Male,No,Thur,Lunch,6,5.72,Steven Carlson,3526515703718508,Thur1025,8508,Ok

### 10. Multi-index

In [44]:
# multi-index/cross-section group by 
df = pd.read_csv('UNZIP_FOR_NOTEBOOKS_FINAL//03-Pandas//mpg.csv')
year_cyl = df.groupby(['model_year','cylinders']).mean()
print(year_cyl.index.levels)

# single row
print(year_cyl.loc[(70,8)]) 

# cross-section
print(year_cyl.xs(key=70,axis=0,level='model_year'))

# swap levels
print(year_cyl.swaplevel().head())

# sort 
print(year_cyl.sort_index(level='model_year',ascending=False))

# group by 
print(df.groupby('model_year').agg({'mpg':['median','mean'],'weight':['mean','std']}))

[[70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82], [3, 4, 5, 6, 8]]
mpg               14.111111
displacement     367.555556
weight          3940.055556
acceleration      11.194444
origin             1.000000
Name: (70, 8), dtype: float64
                 mpg  displacement       weight  acceleration    origin
cylinders
4          25.285714    107.000000  2292.571429     16.000000  2.285714
6          20.500000    199.000000  2710.500000     15.500000  1.000000
8          14.111111    367.555556  3940.055556     11.194444  1.000000
                            mpg  displacement       weight  acceleration  \
cylinders model_year
4         70          25.285714    107.000000  2292.571429     16.000000
6         70          20.500000    199.000000  2710.500000     15.500000
8         70          14.111111    367.555556  3940.055556     11.194444
4         71          27.461538    101.846154  2056.384615     16.961538
6         71          18.000000    243.375000  3171.875000     14.750000

                        origin
cylinders model_year
4         70          2.285714
6         70          1.000000
8         70          1.000000
4         71          1.923077
6         71          1.000000
                            mpg  displacement       weight  acceleration  \
model_year cylinders
82         6          28.333333    225.000000  2931.666667     16.033333
           4          32.071429    118.571429  2402.321429     16.703571
81         8          26.600000    350.000000  3725.000000     19.000000
           6          23.428571    184.000000  3093.571429     15.442857
           4          32.814286    108.857143  2275.476190     16.466667
80         6          25.900000    196.500000  3145.500000     15.050000
           5          36.400000    121.000000  2950.000000     19.900000
           4          34.612000    111.000000  2360.080000     17.144000
           3          23.700000     70.000000  2420.000000     12.500000
79         8          18.630000    321.400000  3862.900000     15.400000
           6          22.950000    205.666667  3025.833333     15.433333
           5          25.400000    183.000000  3530.000000     20.100000
           4          31.525000    113.583333  2357.583333     15.991667
78         8          19.050000    300.833333  3563.333333     13.266667
           6          19.066667    213.250000  3314.166667     16.391667
           5          20.300000    131.000000  2830.000000     15.900000
           4          29.576471    112.117647  2296.764706     16.282353
77         8          16.000000    335.750000  4177.500000     13.662500
           6          19.500000    220.400000  3383.000000     16.900000
           4          29.107143    106.500000  2205.071429     16.064286
           3          21.500000     80.000000  2720.000000     13.500000
76         8          14.666667    324.000000  4064.666667     13.222222
           6          20.000000    221.400000  3349.600000     17.000000
           4          26.766667    106.333333  2306.600000     16.866667
75         8          15.666667    330.500000  4108.833333     13.166667
           6          17.583333    233.750000  3398.333333     17.708333
           4          25.250000    114.833333  2489.250000     15.833333
74         8          14.200000    315.200000  4438.400000     14.700000
           6          17.857143    230.428571  3320.000000     16.857143
           4          27.800000     96.533333  2151.466667     16.400000
73         8          13.200000    365.250000  4279.050000     12.250000
           6          19.000000    212.250000  2917.125000     15.687500
           4          22.727273    109.272727  2338.090909     17.136364
           3          18.000000     70.000000  2124.000000     13.500000
72         8          13.615385    344.846154  4228.384615     13.000000
           4          23.428571    111.535714  2382.642857     17.214286
           3          19.000000     70.000000  2330.000000     13.500000
71         8          13.428571    371.714286  4537.714286     12.214286
           6          18.000000    243.375000  3171.875000     14.750000
           4          27.461538    101.846154  2056.384615     16.961538
70         8          14.111111    367.555556  3940.055556     11.194444
           6          20.500000    199.000000  2710.500000     15.500000
           4          25.285714    107.000000  2292.571429     16.000000

                        origin
model_year cylinders
82         6          1.000000
           4          1.714286
81         8          1.000000
           6          1.714286
           4          2.095238
80         6          2.000000
           5          2.000000
           4          2.200000
           3          3.000000
79         8          1.000000
           6          1.000000
           5          2.000000
           4          1.583333
78         8          1.000000
           6          1.166667
           5          2.000000
           4          2.117647
77         8          1.000000
           6          1.400000
           4          1.857143
           3          3.000000
76         8          1.000000
           6          1.300000
           4          1.866667
75         8          1.000000
           6          1.000000
           4          2.166667
74         8          1.000000
           6          1.000000
           4          2.200000
73         8          1.000000
           6          1.250000
           4          2.000000
           3          3.000000
72         8          1.000000
           4          1.928571
           3          3.000000
71         8          1.000000
           6          1.000000
           4          1.923077
70         8          1.000000
           6          1.000000
           4          2.285714
              mpg                  weight
           median       mean         mean          std
model_year
70          16.00  17.689655  3372.793103   852.868663
71          19.00  21.250000  2995.428571  1061.830859
72          18.50  18.714286  3237.714286   974.520960
73          16.00  17.100000  3419.025000   974.809133
74          24.00  22.703704  2877.925926   949.308571
75          19.50  20.266667  3176.800000   765.179781
76          21.00  21.573529  3078.735294   821.371481
77          21.75  23.375000  2997.357143   912.825902
78          20.70  24.061111  2861.805556   626.023907
79          23.90  25.093103  3055.344828   747.881497
80          32.70  33.696552  2436.655172   432.235491
81          31.60  30.334483  2522.931034   533.600501
82          32.00  31.709677  2453.548387   354.276713

### 11. Text/String manipulation

In [13]:
# pandas and text 
tech_finance = ['GOOG,APPL,AMZN','JPM,BAC,GS']
tickers = pd.Series(tech_finance)
print(tickers)
print(tickers.str.split(','))
print(tickers.str.split(',')[0]) # first row
print(tickers.str.split(',').str[0]) # first col
tech_finance_series = pd.Series(tech_finance)
print(tech_finance_series[tech_finance_series.str.contains('AC')])
tickers.str.split(',',expand=True)

0    GOOG,APPL,AMZN
1        JPM,BAC,GS
dtype: object
0    [GOOG, APPL, AMZN]
1        [JPM, BAC, GS]
dtype: object
['GOOG', 'APPL', 'AMZN']
0    GOOG
1     JPM
dtype: object
1    JPM,BAC,GS
dtype: object

      0     1     2
0  GOOG  APPL  AMZN
1   JPM   BAC    GS

In [14]:
# clean strings 
messy_names = pd.Series(["andrew  ","bo;bo","  claire  "])
print(messy_names.str.replace(";","").str.strip().str.capitalize())

def cleanup(name):
    name = name.replace(";","")
    name = name.strip()
    name = name.capitalize()
    return name
np.vectorize(cleanup)(messy_names)

0    Andrew
1      Bobo
2    Claire
dtype: object

array(['Andrew', 'Bobo', 'Claire'], dtype='<U6')

### 12. Datetime

In [57]:
# pandas datetime
euro_date = '10-12-2000'
pd.to_datetime(euro_date,dayfirst=True)

Timestamp('2000-12-10 00:00:00')

In [61]:
# pandas custom string formating datetime
"""
A full table of codes can be found here:
https://docs.python.org/3/library/datetime.html#strftime-and-strptime-format-codes
"""
style_date = '12--Dec--2000'
pd.to_datetime(style_date, format='%d--%b--%Y')

Timestamp('2000-12-12 00:00:00')

In [67]:
# pandas datetime column
sales = pd.read_csv('UNZIP_FOR_NOTEBOOKS_FINAL//03-Pandas//RetailSales_BeerWineLiquor.csv', parse_dates=[0])
print(sales['DATE'].dt.is_leap_year)
sales = sales.set_index("DATE")

0       True
1       True
2       True
3       True
4       True
       ...
335    False
336     True
337     True
338     True
339     True
Name: DATE, Length: 340, dtype: bool

When calling .resample() you first need to pass in a rule parameter, then you need to call some sort of aggregation function.
The rule parameter describes the frequency with which to apply the aggregation function (daily, monthly, yearly, etc.)
It is passed in using an "offset alias" - refer to the table below. [[reference](http://pandas.pydata.org/pandas-docs/stable/user_guide/timeseries.html#offset-aliases)]
The aggregation function is needed because, due to resampling, we need some sort of mathematical rule to join the rows (mean, sum, count, etc.)

<table style="display: inline-block">
    <caption style="text-align: center"><strong>TIME SERIES OFFSET ALIASES</strong></caption>
<tr><th>ALIAS</th><th>DESCRIPTION</th></tr>
<tr><td>B</td><td>business day frequency</td></tr>
<tr><td>C</td><td>custom business day frequency (experimental)</td></tr>
<tr><td>D</td><td>calendar day frequency</td></tr>
<tr><td>W</td><td>weekly frequency</td></tr>
<tr><td>M</td><td>month end frequency</td></tr>
<tr><td>SM</td><td>semi-month end frequency (15th and end of month)</td></tr>
<tr><td>BM</td><td>business month end frequency</td></tr>
<tr><td>CBM</td><td>custom business month end frequency</td></tr>
<tr><td>MS</td><td>month start frequency</td></tr>
<tr><td>SMS</td><td>semi-month start frequency (1st and 15th)</td></tr>
<tr><td>BMS</td><td>business month start frequency</td></tr>
<tr><td>CBMS</td><td>custom business month start frequency</td></tr>
<tr><td>Q</td><td>quarter end frequency</td></tr>
<tr><td></td><td><font color=white>intentionally left blank</font></td></tr></table>

<table style="display: inline-block; margin-left: 40px">
<caption style="text-align: center"></caption>
<tr><th>ALIAS</th><th>DESCRIPTION</th></tr>
<tr><td>BQ</td><td>business quarter endfrequency</td></tr>
<tr><td>QS</td><td>quarter start frequency</td></tr>
<tr><td>BQS</td><td>business quarter start frequency</td></tr>
<tr><td>A</td><td>year end frequency</td></tr>
<tr><td>BA</td><td>business year end frequency</td></tr>
<tr><td>AS</td><td>year start frequency</td></tr>
<tr><td>BAS</td><td>business year start frequency</td></tr>
<tr><td>BH</td><td>business hour frequency</td></tr>
<tr><td>H</td><td>hourly frequency</td></tr>
<tr><td>T, min</td><td>minutely frequency</td></tr>
<tr><td>S</td><td>secondly frequency</td></tr>
<tr><td>L, ms</td><td>milliseconds</td></tr>
<tr><td>U, us</td><td>microseconds</td></tr>
<tr><td>N</td><td>nanoseconds</td></tr></table>

In [66]:
# Yearly Means
sales.resample(rule='A').mean()

            MRTSSM4453USN
DATE
1992-12-31    1807.250000
1993-12-31    1794.833333
1994-12-31    1841.750000
1995-12-31    1833.916667
1996-12-31    1929.750000
1997-12-31    2006.750000
1998-12-31    2115.166667
1999-12-31    2206.333333
2000-12-31    2375.583333
2001-12-31    2468.416667
2002-12-31    2491.166667
2003-12-31    2539.083333
2004-12-31    2682.416667
2005-12-31    2797.250000
2006-12-31    3001.333333
2007-12-31    3177.333333
2008-12-31    3292.000000
2009-12-31    3353.750000
2010-12-31    3450.083333
2011-12-31    3532.666667
2012-12-31    3697.083333
2013-12-31    3839.666667
2014-12-31    4023.833333
2015-12-31    4212.500000
2016-12-31    4434.416667
2017-12-31    4602.666667
2018-12-31    4830.666667
2019-12-31    4972.750000
2020-12-31    4922.500000

In [21]:
# day of week avgs 
hotels = pd.read_csv("UNZIP_FOR_NOTEBOOKS_FINAL//03-Pandas//hotel_booking_data.csv")
def convert(day,month,year):
    return f'{day}-{month}-{year}'
hotels['date']  = np.vectorize(convert)(hotels['arrival_date_day_of_month'],
                                        hotels['arrival_date_month'],
                                        hotels['arrival_date_year'])
hotels['date'] = pd.to_datetime(hotels['date'])
hotels['date'].dt.day_name().value_counts()

Friday       19631
Thursday     19254
Monday       18171
Saturday     18055
Wednesday    16139
Sunday       14141
Tuesday      13999
Name: date, dtype: int64

### 14. read in different file formats

In [76]:
# read in html
tables = pd.read_html('https://en.wikipedia.org/wiki/World_population')
world_pop = tables[0].drop('#',axis=1)
print(world_pop.head())
df.to_html('simple.html',index=False)

  Most populous countries  2000  2015 2030[A]
0                China[B]  1270  1376    1416
1                   India  1053  1311    1528
2           United States   283   322     356
3               Indonesia   212   258     295
4                Pakistan   136   208     245

In [5]:
# read in excel 
excel_sheets = pd.read_excel('UNZIP_FOR_NOTEBOOKS_FINAL//03-Pandas//my_excel_file.xlsx',sheet_name=None)
print(excel_sheets['First_Sheet'])
df.to_excel('example.xlsx',sheet_name='First_Sheet',index=False)

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

### 15. Pivot table

In [7]:
# pivot table
df = pd.read_csv('UNZIP_FOR_NOTEBOOKS_FINAL//03-Pandas//Sales_Funnel_CRM.csv')
help(pd.pivot)

Help on function pivot in module pandas.core.reshape.pivot:

pivot(data: 'DataFrame', index: Union[Hashable, NoneType, Sequence[Union[Hashable, NoneType]]] = None, columns: Union[Hashable, NoneType, Sequence[Union[Hashable, NoneType]]] = None, values: Union[Hashable, NoneType, Sequence[Union[Hashable, NoneType]]] = None) -> 'DataFrame'
    Return reshaped DataFrame organized by given index / column values.

    Reshape data (produce a "pivot" table) based on column values. Uses
    unique values from specified `index` / `columns` to form axes of the
    resulting DataFrame. This function does not support data
    aggregation, multiple values will result in a MultiIndex in the
    columns. See the :ref:`User Guide <reshaping>` for more on reshaping.

    Parameters
    ----------
    data : DataFrame
    index : str or object or a list of str, optional
        Column to use to make new frame's index. If None, uses
        existing index.

        .. versionchanged:: 1.1.0
           Also accept list of index names.

    columns : str or object or a list of str
        Column to use to make new frame's columns.

        .. versionchanged:: 1.1.0
           Also accept list of columns names.

    values : str, object or a list of the previous, optional
        Column(s) to use for populating new frame's values. If not
        specified, all remaining columns will be used and the result will
        have hierarchically indexed columns.

        .. versionchanged:: 0.23.0
           Also accept list of column names.

    Returns
    -------
    DataFrame
        Returns reshaped DataFrame.

    Raises
    ------
    ValueError:
        When there are any `index`, `columns` combinations with multiple
        values. `DataFrame.pivot_table` when you need to aggregate.

    See Also
    --------
    DataFrame.pivot_table : Generalization of pivot that can handle
        duplicate values for one index/column pair.
    DataFrame.unstack : Pivot based on the index values instead of a
        column.

    Notes
    -----
    For finer-tuned control, see hierarchical indexing documentation along
    with the related stack/unstack methods.

    Examples
    --------
    >>> df = pd.DataFrame({'foo': ['one', 'one', 'one', 'two', 'two',
    ...                            'two'],
    ...                    'bar': ['A', 'B', 'C', 'A', 'B', 'C'],
    ...                    'baz': [1, 2, 3, 4, 5, 6],
    ...                    'zoo': ['x', 'y', 'z', 'q', 'w', 't']})
    >>> df
        foo   bar  baz  zoo
    0   one   A    1    x
    1   one   B    2    y
    2   one   C    3    z
    3   two   A    4    q
    4   two   B    5    w
    5   two   C    6    t

    >>> df.pivot(index='foo', columns='bar', values='baz')
    bar  A   B   C
    foo
    one  1   2   3
    two  4   5   6

    >>> df.pivot(index='foo', columns='bar')['baz']
    bar  A   B   C
    foo
    one  1   2   3
    two  4   5   6

    >>> df.pivot(index='foo', columns='bar', values=['baz', 'zoo'])
          baz       zoo
    bar   A  B  C   A  B  C
    foo
    one   1  2  3   x  y  z
    two   4  5  6   q  w  t

    You could also assign a list of column names or a list of index names.

    >>> df = pd.DataFrame({
    ...        "lev1": [1, 1, 1, 2, 2, 2],
    ...        "lev2": [1, 1, 2, 1, 1, 2],
    ...        "lev3": [1, 2, 1, 2, 1, 2],
    ...        "lev4": [1, 2, 3, 4, 5, 6],
    ...        "values": [0, 1, 2, 3, 4, 5]})
    >>> df
        lev1 lev2 lev3 lev4 values
    0   1    1    1    1    0
    1   1    1    2    2    1
    2   1    2    1    3    2
    3   2    1    2    4    3
    4   2    1    1    5    4
    5   2    2    2    6    5

    >>> df.pivot(index="lev1", columns=["lev2", "lev3"],values="values")
    lev2    1         2
    lev3    1    2    1    2
    lev1
    1     0.0  1.0  2.0  NaN
    2     4.0  3.0  NaN  5.0

    >>> df.pivot(index=["lev1", "lev2"], columns=["lev3"],values="values")
          lev3    1    2
    lev1  lev2
       1     1  0.0  1.0
             2  2.0  NaN
       2     1  4.0  3.0
             2  NaN  5.0

    A ValueError is raised if there are any duplicates.

    >>> df = pd.DataFrame({"foo": ['one', 'one', 'two', 'two'],
    ...                    "bar": ['A', 'A', 'B', 'C'],
    ...                    "baz": [1, 2, 3, 4]})
    >>> df
       foo bar  baz
    0  one   A    1
    1  one   A    2
    2  two   B    3
    3  two   C    4

    Notice that the first two rows are the same for our `index`
    and `columns` arguments.

    >>> df.pivot(index='foo', columns='bar', values='baz')
    Traceback (most recent call last):
       ...
    ValueError: Index contains duplicate entries, cannot reshape

In [8]:
# Let's take a subset, otherwise we'll get an error due to duplicate rows and data
licenses = df[['Company','Product','Licenses']]
"""
Similar to the pivot() method, the pivot_table() can add aggregation functions to a pivot call.
"""
pd.pivot_table(df,index=["Account Manager","Contact"],values=["Sale Price"],columns=["Product"],
               aggfunc=[np.sum,np.mean],fill_value=0)

                                    sum                                      \
                             Sale Price
Product                       Analytics GPS Positioning Prediction Tracking
Account Manager Contact
Claude Shannon  Cindy Phoner    6650000               0     700000   350000
                Emma Gordian   11550000          350000          0   490000
Edward Thorp    Elon Tusk       7350000               0     700000        0
                Larry Pager     4550000               0     700000   350000
                Will Grates     2450000               0          0   350000

                                   mean
                             Sale Price
Product                       Analytics GPS Positioning Prediction Tracking
Account Manager Contact
Claude Shannon  Cindy Phoner    3325000               0     700000   350000
                Emma Gordian    5775000          350000          0   490000
Edward Thorp    Elon Tusk       3675000               0     700000        0
                Larry Pager     2275000               0     700000   350000
                Will Grates     2450000               0          0   350000

In [43]:
df = pd.DataFrame({'Date':['10/2/2011', '11/2/2011', '12/2/2011', '13/2/2011'],
                    'Event':['Music', 'Poetry', 'Theatre', 'Comedy'],
                    'Cost':[10000, 5000, 15000, 2000]})
 
# Print the dataframe
print(df)

        Date    Event   Cost
0  10/2/2011    Music  10000
1  11/2/2011   Poetry   5000
2  12/2/2011  Theatre  15000
3  13/2/2011   Comedy   2000

### 16. Use sql

In [45]:
df.query("Cost >= 1000")

        Date    Event   Cost  Discounted_Price
0  10/2/2011    Music  10000            1000.0
1  11/2/2011   Poetry   5000             500.0
2  12/2/2011  Theatre  15000            1500.0
3  13/2/2011   Comedy   2000             200.0

In [23]:
import collections

def text_process(text):
    text_split = text.split(' ')
    shuffle = {}
    for text in text_split:
        print(text)
        if text in shuffle:
            shuffle[text]+=1
        else:
            shuffle[text] = 1
            
    result = collections.OrderedDict(sorted(shuffle.items()))
    return result 

text_process('I just need more more sleep')

I
just
need
more
more
sleep

OrderedDict([('I', 1), ('just', 1), ('more', 2), ('need', 1), ('sleep', 1)])